# 데이터 프레임 실습
시리즈 객체가 2개이상 합쳐진 pandas의 데이터 타입  
행(row) 인덱스, entry, instance  
열(column) feature

## DataFrame 만들기

In [2]:
import pandas as pd

In [2]:
a = pd.DataFrame()
data = [1,2,3,[11,22]]

In [3]:
data[3][1]

22

In [3]:
data = [[1,2,3], ['a','b','c']]
df = pd.DataFrame(data)
df

   0  1  2
0  1  2  3
1  a  b  c

## DataFrame 속성 읽기
- index, columns, values, ndim, size, shape
- info(), describe()

In [7]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [8]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [11]:
df.values

array([[1, 2, 3],
       ['a', 'b', 'c']], dtype=object)

In [13]:
print(df.index, df.columns, df.values, df.ndim, df.size, df.shape, sep='\n')

RangeIndex(start=0, stop=2, step=1)
RangeIndex(start=0, stop=3, step=1)
[[1 2 3]
 ['a' 'b' 'c']]
2
6
(2, 3)
<bound method DataFrame.info of    0  1  2
0  1  2  3
1  a  b  c>

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      object
 1   1       2 non-null      object
 2   2       2 non-null      object
dtypes: object(3)
memory usage: 176.0+ bytes

In [4]:
df.describe()

        0  1  2
count   2  2  2
unique  2  2  2
top     1  2  3
freq    1  1  1

In [49]:
# Dict 데이터로 Dataframe 객체 생성하기
pd2 = pd.DataFrame({'name':['hong', 'lee'], 'age':[12,5], 'loc': ['daegu', 'busan'], 'gen': ['f', 'm']})

pd2   # key가 컬럼이 되어버린다.

   name  age    loc gen
0  hong   12  daegu   f
1   lee    5  busan   m

In [16]:
pd2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   age     2 non-null      int64
 2   loc     2 non-null      object
 3   gen     2 non-null      object
dtypes: int64(1), object(3)
memory usage: 192.0+ bytes

In [17]:
pp = pd.DataFrame()
pp

Empty DataFrame
Columns: []
Index: []

In [18]:
pp.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Empty DataFrame

In [19]:
pp.empty

True

In [31]:
pd2

   name  age    loc gen
0  hong   12  daegu   f
1   lee    5  busan   m

## DataFrame 객체에서 'Busan'데이터 추출

In [45]:
# DataFrame 객체에서 'Busan'데이터 추출
pd2['loc'][1]

'busan'

In [51]:
pd2.T[1]['loc']

'busan'